[Survived] LogicalOperator
routes/checkout.js:9:21
 
 const router = express.Router();
 
-const STATUS_FLOW = Order.STATUS_FLOW || [];
+const STATUS_FLOW = Order.STATUS_FLOW && [];
 
 const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;

[Survived] ConditionalExpression
routes/checkout.js:9:21
 
 const router = express.Router();
 
-const STATUS_FLOW = Order.STATUS_FLOW || [];
+const STATUS_FLOW = true;
 
 const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;

[Killed] Regex
routes/checkout.js:11:20
 
 const STATUS_FLOW = Order.STATUS_FLOW || [];
 
-const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const emailRegex = /^[^\S@]+@[^\s@]+\.[^\s@]+$/;
 
 async function generateOrderNumber() {
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] Regex
routes/checkout.js:11:20
 
 const STATUS_FLOW = Order.STATUS_FLOW || [];
 
-const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const emailRegex = /^[^\s@]+@[^\s@]+\.[\s@]+$/;
 
 async function generateOrderNumber() {
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
routes/checkout.js:13:38
 
 const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
 
-async function generateOrderNumber() {
-  for (let attempt = 0; attempt < 6; attempt += 1) {
-    const candidate = `FE-${randomInt(100000, 999999)}`;
-    // eslint-disable-next-line no-await-in-loop
-    const exists = await Order.exists({ orderNumber: candidate });
-    if (!exists) {
-      return candidate;
-    }
-  }
-  return `FE-${Date.now()}`;
-}
+async function generateOrderNumber() {}
 
 /**
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FE-111111"
Received: undefined

[Killed] EqualityOperator
routes/checkout.js:14:25
 const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
 
 async function generateOrderNumber() {
-  for (let attempt = 0; attempt < 6; attempt += 1) {
+  for (let attempt = 0; attempt >= 6; attempt += 1) {
     const candidate = `FE-${randomInt(100000, 999999)}`;
     // eslint-disable-next-line no-await-in-loop
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FE-111111"
Received: "FE-1776490376743"

[Killed] ConditionalExpression
routes/checkout.js:14:25
 const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
 
 async function generateOrderNumber() {
-  for (let attempt = 0; attempt < 6; attempt += 1) {
+  for (let attempt = 0; false; attempt += 1) {
     const candidate = `FE-${randomInt(100000, 999999)}`;
     // eslint-disable-next-line no-await-in-loop
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FE-111111"
Received: "FE-1776490376633"

[Survived] ObjectLiteral
routes/checkout.js:17:39
   for (let attempt = 0; attempt < 6; attempt += 1) {
     const candidate = `FE-${randomInt(100000, 999999)}`;
     // eslint-disable-next-line no-await-in-loop
-    const exists = await Order.exists({ orderNumber: candidate });
+    const exists = await Order.exists({});
     if (!exists) {
       return candidate;

[Killed] BooleanLiteral
routes/checkout.js:18:9
     const candidate = `FE-${randomInt(100000, 999999)}`;
     // eslint-disable-next-line no-await-in-loop
     const exists = await Order.exists({ orderNumber: candidate });
-    if (!exists) {
+    if (exists) {
       return candidate;
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FE-111111"
Received: "FE-1776490377138"

[Killed] ConditionalExpression
routes/checkout.js:18:9
     const candidate = `FE-${randomInt(100000, 999999)}`;
     // eslint-disable-next-line no-await-in-loop
     const exists = await Order.exists({ orderNumber: candidate });
-    if (!exists) {
+    if (false) {
       return candidate;
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FE-111111"
Received: "FE-1776490378018"

[Survived] StringLiteral
routes/checkout.js:22:10
       return candidate;
     }
   }
-  return `FE-${Date.now()}`;
+  return ``;
 }
 

[Killed] BooleanLiteral
routes/checkout.js:137:51
   try {
     const { items, name, email, shippingAddress, cardNumber, cardName, expiry, cvc } = req.body;
 
-    if (!Array.isArray(items) || !items.length || !name || !email || !shippingAddress || !cardNumber || !cardName || !expiry || !cvc) {
+    if (!Array.isArray(items) || !items.length || name || !email || !shippingAddress || !cardNumber || !cardName || !expiry || !cvc) {
       return res.status(400).json({ error: 'Missing required fields' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
routes/checkout.js:137:118
   try {
     const { items, name, email, shippingAddress, cardNumber, cardName, expiry, cvc } = req.body;
 
-    if (!Array.isArray(items) || !items.length || !name || !email || !shippingAddress || !cardNumber || !cardName || !expiry || !cvc) {
+    if (!Array.isArray(items) || !items.length || !name || !email || !shippingAddress || !cardNumber || !cardName || expiry || !cvc) {
       return res.status(400).json({ error: 'Missing required fields' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] MethodExpression
routes/checkout.js:141:26
       return res.status(400).json({ error: 'Missing required fields' });
     }
 
-    const trimmedEmail = String(email).trim();
+    const trimmedEmail = String(email);
     const trimmedName = String(name).trim();
     const trimmedAddress = String(shippingAddress).trim();

[Survived] MethodExpression
routes/checkout.js:142:25
     }
 
     const trimmedEmail = String(email).trim();
-    const trimmedName = String(name).trim();
+    const trimmedName = String(name);
     const trimmedAddress = String(shippingAddress).trim();
 

[Survived] MethodExpression
routes/checkout.js:143:28
 
     const trimmedEmail = String(email).trim();
     const trimmedName = String(name).trim();
-    const trimmedAddress = String(shippingAddress).trim();
+    const trimmedAddress = String(shippingAddress);
 
     if (!trimmedName || !trimmedAddress) {

[Killed] ConditionalExpression
routes/checkout.js:145:9
     const trimmedName = String(name).trim();
     const trimmedAddress = String(shippingAddress).trim();
 
-    if (!trimmedName || !trimmedAddress) {
+    if (true) {
       return res.status(400).json({ error: 'Name and shipping address are required.' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
routes/checkout.js:145:25
     const trimmedName = String(name).trim();
     const trimmedAddress = String(shippingAddress).trim();
 
-    if (!trimmedName || !trimmedAddress) {
+    if (!trimmedName || trimmedAddress) {
       return res.status(400).json({ error: 'Name and shipping address are required.' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BlockStatement
routes/checkout.js:149:41
       return res.status(400).json({ error: 'Name and shipping address are required.' });
     }
 
-    if (!emailRegex.test(trimmedEmail)) {
-      return res.status(400).json({ error: 'Invalid email format' });
-    }
+    if (!emailRegex.test(trimmedEmail)) {}
 
     const sanitizedCardNumber = String(cardNumber).replace(/\s+/g, '');
killedBy: POST /api/checkout/create-order 400 → invalid email format
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid email format",
+   "error": "Invalid product reference in order payload.",

[Killed] BooleanLiteral
routes/checkout.js:149:9
       return res.status(400).json({ error: 'Name and shipping address are required.' });
     }
 
-    if (!emailRegex.test(trimmedEmail)) {
+    if (emailRegex.test(trimmedEmail)) {
       return res.status(400).json({ error: 'Invalid email format' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] Regex
routes/checkout.js:153:60
       return res.status(400).json({ error: 'Invalid email format' });
     }
 
-    const sanitizedCardNumber = String(cardNumber).replace(/\s+/g, '');
+    const sanitizedCardNumber = String(cardNumber).replace(/\S+/g, '');
     const sanitizedExpiry = String(expiry).trim();
     const sanitizedCvc = String(cvc).trim();
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Timeout] StringLiteral
routes/checkout.js:153:68
       return res.status(400).json({ error: 'Invalid email format' });
     }
 
-    const sanitizedCardNumber = String(cardNumber).replace(/\s+/g, '');
+    const sanitizedCardNumber = String(cardNumber).replace(/\s+/g, "Stryker was here!");
     const sanitizedExpiry = String(expiry).trim();
     const sanitizedCvc = String(cvc).trim();

[Timeout] MethodExpression
routes/checkout.js:154:29
     }
 
     const sanitizedCardNumber = String(cardNumber).replace(/\s+/g, '');
-    const sanitizedExpiry = String(expiry).trim();
+    const sanitizedExpiry = String(expiry);
     const sanitizedCvc = String(cvc).trim();
     const trimmedCardName = String(cardName).trim();

[Timeout] MethodExpression
routes/checkout.js:155:26
 
     const sanitizedCardNumber = String(cardNumber).replace(/\s+/g, '');
     const sanitizedExpiry = String(expiry).trim();
-    const sanitizedCvc = String(cvc).trim();
+    const sanitizedCvc = String(cvc);
     const trimmedCardName = String(cardName).trim();
 

[Timeout] MethodExpression
routes/checkout.js:156:29
     const sanitizedCardNumber = String(cardNumber).replace(/\s+/g, '');
     const sanitizedExpiry = String(expiry).trim();
     const sanitizedCvc = String(cvc).trim();
-    const trimmedCardName = String(cardName).trim();
+    const trimmedCardName = String(cardName);
 
     if (!trimmedCardName) {

[Killed] ConditionalExpression
routes/checkout.js:158:9
     const sanitizedCvc = String(cvc).trim();
     const trimmedCardName = String(cardName).trim();
 
-    if (!trimmedCardName) {
+    if (true) {
       return res.status(400).json({ error: 'Name on card is required.' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] BooleanLiteral
routes/checkout.js:158:9
     const sanitizedCvc = String(cvc).trim();
     const trimmedCardName = String(cardName).trim();
 
-    if (!trimmedCardName) {
+    if (trimmedCardName) {
       return res.status(400).json({ error: 'Name on card is required.' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Timeout] StringLiteral
routes/checkout.js:159:44
     const trimmedCardName = String(cardName).trim();
 
     if (!trimmedCardName) {
-      return res.status(400).json({ error: 'Name on card is required.' });
+      return res.status(400).json({ error: "" });
     }
 

[Killed] BlockStatement
routes/checkout.js:162:51
       return res.status(400).json({ error: 'Name on card is required.' });
     }
 
-    if (!/^\d{12,16}$/.test(sanitizedCardNumber)) {
-      return res.status(400).json({ error: 'Invalid card number' });
-    }
+    if (!/^\d{12,16}$/.test(sanitizedCardNumber)) {}
 
     if (!/^(0[1-9]|1[0-2])\/(?:\d{2}|\d{4})$/.test(sanitizedExpiry)) {
killedBy: POST /api/checkout/create-order 400 → invalid card number
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid card number",
+   "error": "Invalid product reference in order payload.",

[Timeout] BooleanLiteral
routes/checkout.js:162:9
       return res.status(400).json({ error: 'Name on card is required.' });
     }
 
-    if (!/^\d{12,16}$/.test(sanitizedCardNumber)) {
+    if (/^\d{12,16}$/.test(sanitizedCardNumber)) {
       return res.status(400).json({ error: 'Invalid card number' });
     }

[Killed] ObjectLiteral
routes/checkout.js:163:35
     }
 
     if (!/^\d{12,16}$/.test(sanitizedCardNumber)) {
-      return res.status(400).json({ error: 'Invalid card number' });
+      return res.status(400).json({});
     }
 
killedBy: POST /api/checkout/create-order 400 → invalid card number
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Invalid card number",
- }

[Killed] BlockStatement
routes/checkout.js:166:70
       return res.status(400).json({ error: 'Invalid card number' });
     }
 
-    if (!/^(0[1-9]|1[0-2])\/(?:\d{2}|\d{4})$/.test(sanitizedExpiry)) {
-      return res.status(400).json({ error: 'Invalid expiry date' });
-    }
+    if (!/^(0[1-9]|1[0-2])\/(?:\d{2}|\d{4})$/.test(sanitizedExpiry)) {}
 
     if (!/^\d{3,4}$/.test(sanitizedCvc)) {
killedBy: POST /api/checkout/create-order 400 → invalid expiry date
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid expiry date",
+   "error": "Invalid product reference in order payload.",

[Killed] ConditionalExpression
routes/checkout.js:166:9
       return res.status(400).json({ error: 'Invalid card number' });
     }
 
-    if (!/^(0[1-9]|1[0-2])\/(?:\d{2}|\d{4})$/.test(sanitizedExpiry)) {
+    if (false) {
       return res.status(400).json({ error: 'Invalid expiry date' });
     }
killedBy: POST /api/checkout/create-order 400 → invalid expiry date
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid expiry date",
+   "error": "Invalid product reference in order payload.",

[Killed] ObjectLiteral
routes/checkout.js:167:35
     }
 
     if (!/^(0[1-9]|1[0-2])\/(?:\d{2}|\d{4})$/.test(sanitizedExpiry)) {
-      return res.status(400).json({ error: 'Invalid expiry date' });
+      return res.status(400).json({});
     }
 
killedBy: POST /api/checkout/create-order 400 → invalid expiry date
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Invalid expiry date",
- }

[Killed] ConditionalExpression
routes/checkout.js:170:9
       return res.status(400).json({ error: 'Invalid expiry date' });
     }
 
-    if (!/^\d{3,4}$/.test(sanitizedCvc)) {
+    if (false) {
       return res.status(400).json({ error: 'Invalid CVC' });
     }
killedBy: POST /api/checkout/create-order 400 → invalid CVC
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid CVC",
+   "error": "Invalid product reference in order payload.",

[Killed] BooleanLiteral
routes/checkout.js:170:9
       return res.status(400).json({ error: 'Invalid expiry date' });
     }
 
-    if (!/^\d{3,4}$/.test(sanitizedCvc)) {
+    if (/^\d{3,4}$/.test(sanitizedCvc)) {
       return res.status(400).json({ error: 'Invalid CVC' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] StringLiteral
routes/checkout.js:171:44
     }
 
     if (!/^\d{3,4}$/.test(sanitizedCvc)) {
-      return res.status(400).json({ error: 'Invalid CVC' });
+      return res.status(400).json({ error: "" });
     }
 
killedBy: POST /api/checkout/create-order 400 → invalid CVC
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid CVC",
+   "error": "",

[Killed] BlockStatement
routes/checkout.js:175:31
     }
 
     const normalizedItems = [];
-    for (const item of items) {
-      const productId = item?.productId || item?.id;
-      const quantity = Number.isInteger(item?.quantity) && item.quantity > 0 ? item.quantity : 1;
-
-      if (!productId || !mongoose.Types.ObjectId.isValid(productId)) {
-        return res.status(400).json({ error: 'Invalid product reference in order payload.' });
-      }
-
-      normalizedItems.push({
-        productId: String(productId),
-        quantity,
-      });
-    }
+    for (const item of items) {}
 
     const productIds = [...new Set(normalizedItems.map(item => item.productId))];
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] ConditionalExpression
routes/checkout.js:176:25
 
     const normalizedItems = [];
     for (const item of items) {
-      const productId = item?.productId || item?.id;
+      const productId = true;
       const quantity = Number.isInteger(item?.quantity) && item.quantity > 0 ? item.quantity : 1;
 
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] LogicalOperator
routes/checkout.js:176:25
 
     const normalizedItems = [];
     for (const item of items) {
-      const productId = item?.productId || item?.id;
+      const productId = item?.productId && item?.id;
       const quantity = Number.isInteger(item?.quantity) && item.quantity > 0 ? item.quantity : 1;
 
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] LogicalOperator
routes/checkout.js:177:24
     const normalizedItems = [];
     for (const item of items) {
       const productId = item?.productId || item?.id;
-      const quantity = Number.isInteger(item?.quantity) && item.quantity > 0 ? item.quantity : 1;
+      const quantity = Number.isInteger(item?.quantity) || item.quantity > 0 ? item.quantity : 1;
 
       if (!productId || !mongoose.Types.ObjectId.isValid(productId)) {

[Survived] EqualityOperator
routes/checkout.js:177:60
     const normalizedItems = [];
     for (const item of items) {
       const productId = item?.productId || item?.id;
-      const quantity = Number.isInteger(item?.quantity) && item.quantity > 0 ? item.quantity : 1;
+      const quantity = Number.isInteger(item?.quantity) && item.quantity <= 0 ? item.quantity : 1;
 
       if (!productId || !mongoose.Types.ObjectId.isValid(productId)) {

[Killed] ConditionalExpression
routes/checkout.js:179:11
       const productId = item?.productId || item?.id;
       const quantity = Number.isInteger(item?.quantity) && item.quantity > 0 ? item.quantity : 1;
 
-      if (!productId || !mongoose.Types.ObjectId.isValid(productId)) {
+      if (true) {
         return res.status(400).json({ error: 'Invalid product reference in order payload.' });
       }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] LogicalOperator
routes/checkout.js:179:11
       const productId = item?.productId || item?.id;
       const quantity = Number.isInteger(item?.quantity) && item.quantity > 0 ? item.quantity : 1;
 
-      if (!productId || !mongoose.Types.ObjectId.isValid(productId)) {
+      if (!productId && !mongoose.Types.ObjectId.isValid(productId)) {
         return res.status(400).json({ error: 'Invalid product reference in order payload.' });
       }
killedBy: Checkout API advanced scenarios 400 → rejects invalid product references before persistence
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Killed] ObjectLiteral
routes/checkout.js:180:37
       const quantity = Number.isInteger(item?.quantity) && item.quantity > 0 ? item.quantity : 1;
 
       if (!productId || !mongoose.Types.ObjectId.isValid(productId)) {
-        return res.status(400).json({ error: 'Invalid product reference in order payload.' });
+        return res.status(400).json({});
       }
 
killedBy: Checkout API advanced scenarios 400 → rejects invalid product references before persistence
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Invalid product reference in order payload.",
- }

[Killed] ObjectLiteral
routes/checkout.js:183:28
         return res.status(400).json({ error: 'Invalid product reference in order payload.' });
       }
 
-      normalizedItems.push({
-        productId: String(productId),
-        quantity,
-      });
+      normalizedItems.push({});
     }
 
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Survived] ArrowFunction
routes/checkout.js:189:56
       });
     }
 
-    const productIds = [...new Set(normalizedItems.map(item => item.productId))];
+    const productIds = [...new Set(normalizedItems.map(() => undefined))];
     const products = await Product.find({ _id: { $in: productIds } }).lean();
 

[Survived] ObjectLiteral
routes/checkout.js:190:48
     }
 
     const productIds = [...new Set(normalizedItems.map(item => item.productId))];
-    const products = await Product.find({ _id: { $in: productIds } }).lean();
+    const products = await Product.find({ _id: {} }).lean();
 
     if (products.length !== productIds.length) {

[Killed] ConditionalExpression
routes/checkout.js:192:9
     const productIds = [...new Set(normalizedItems.map(item => item.productId))];
     const products = await Product.find({ _id: { $in: productIds } }).lean();
 
-    if (products.length !== productIds.length) {
+    if (true) {
       return res.status(400).json({ error: 'One or more products are no longer available.' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Killed] EqualityOperator
routes/checkout.js:192:9
     const productIds = [...new Set(normalizedItems.map(item => item.productId))];
     const products = await Product.find({ _id: { $in: productIds } }).lean();
 
-    if (products.length !== productIds.length) {
+    if (products.length === productIds.length) {
       return res.status(400).json({ error: 'One or more products are no longer available.' });
     }
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 400

[Survived] ObjectLiteral
routes/checkout.js:193:35
     const products = await Product.find({ _id: { $in: productIds } }).lean();
 
     if (products.length !== productIds.length) {
-      return res.status(400).json({ error: 'One or more products are no longer available.' });
+      return res.status(400).json({});
     }
 

[Survived] StringLiteral
routes/checkout.js:193:44
     const products = await Product.find({ _id: { $in: productIds } }).lean();
 
     if (products.length !== productIds.length) {
-      return res.status(400).json({ error: 'One or more products are no longer available.' });
+      return res.status(400).json({ error: "" });
     }
 

[Killed] ArrowFunction
routes/checkout.js:196:45
       return res.status(400).json({ error: 'One or more products are no longer available.' });
     }
 
-    const productMap = new Map(products.map(product => [String(product._id), product]));
+    const productMap = new Map(products.map(() => undefined));
 
     const orderItems = normalizedItems.map(item => {
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] BlockStatement
routes/checkout.js:198:52
 
     const productMap = new Map(products.map(product => [String(product._id), product]));
 
-    const orderItems = normalizedItems.map(item => {
-      const product = productMap.get(item.productId);
-      return {
-        productId: product._id,
-        name: product.name,
-        price: product.price,
-        quantity: item.quantity,
-        image: product.image,
-      };
-    });
+    const orderItems = normalizedItems.map(item => {});
 
     const orderTotal = orderItems.reduce((sum, item) => sum + item.price * item.quantity, 0);
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 201
Received: 500

[Killed] ObjectLiteral
routes/checkout.js:200:14
 
     const orderItems = normalizedItems.map(item => {
       const product = productMap.get(item.productId);
-      return {
-        productId: product._id,
-        name: product.name,
-        price: product.price,
-        quantity: item.quantity,
-        image: product.image,
-      };
+      return {};
     });
 
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 4
+ Received  + 1

- Object {
-   "name": "Fusion Laptop",
-   "quantity": 1,

[Survived] ArithmeticOperator
routes/checkout.js:209:63
       };
     });
 
-    const orderTotal = orderItems.reduce((sum, item) => sum + item.price * item.quantity, 0);
+    const orderTotal = orderItems.reduce((sum, item) => sum + item.price / item.quantity, 0);
 
     const orderNumber = await generateOrderNumber();

[Survived] ArrowFunction
routes/checkout.js:209:42
       };
     });
 
-    const orderTotal = orderItems.reduce((sum, item) => sum + item.price * item.quantity, 0);
+    const orderTotal = orderItems.reduce(() => undefined, 0);
 
     const orderNumber = await generateOrderNumber();

[Survived] ArithmeticOperator
routes/checkout.js:212:53
     const orderTotal = orderItems.reduce((sum, item) => sum + item.price * item.quantity, 0);
 
     const orderNumber = await generateOrderNumber();
-    const estimatedDelivery = new Date(Date.now() + randomInt(2, 6) * 24 * 60 * 60 * 1000);
+    const estimatedDelivery = new Date(Date.now() + randomInt(2, 6) * 24 * 60 / 60 * 1000);
 
     const order = new Order({

[Survived] ArithmeticOperator
routes/checkout.js:212:40
     const orderTotal = orderItems.reduce((sum, item) => sum + item.price * item.quantity, 0);
 
     const orderNumber = await generateOrderNumber();
-    const estimatedDelivery = new Date(Date.now() + randomInt(2, 6) * 24 * 60 * 60 * 1000);
+    const estimatedDelivery = new Date(Date.now() - randomInt(2, 6) * 24 * 60 * 60 * 1000);
 
     const order = new Order({

[Killed] ObjectLiteral
routes/checkout.js:214:29
     const orderNumber = await generateOrderNumber();
     const estimatedDelivery = new Date(Date.now() + randomInt(2, 6) * 24 * 60 * 60 * 1000);
 
-    const order = new Order({
-      orderNumber,
-      email: trimmedEmail.toLowerCase(),
-      name: trimmedName,
-      shippingAddress: trimmedAddress,
-      items: orderItems,
-      total: orderTotal,
-      estimatedDelivery,
-    });
+    const order = new Order({});
 
     order.ensureInitialStatus();
killedBy: Checkout API advanced scenarios 201 → accepts a valid 15-digit Amex with 4-digit CVC
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] MethodExpression
routes/checkout.js:216:14
 
     const order = new Order({
       orderNumber,
-      email: trimmedEmail.toLowerCase(),
+      email: trimmedEmail.toUpperCase(),
       name: trimmedName,
       shippingAddress: trimmedAddress,

[Timeout] ArrowFunction
routes/checkout.js:228:23
 
     await order.save();
 
-    await new Promise(resolve => setTimeout(resolve, 1200));
+    await new Promise(() => undefined);
 
     res.status(201).json({

[Survived] BlockStatement
routes/checkout.js:239:19
       items: orderItems,
       total: orderTotal,
     });
-  } catch (error) {
-    console.error('Error creating order:', error);
-    res.status(500).json({ error: 'Failed to create order' });
-  }
+  } catch (error) {}
 });
 
