[Timeout] BlockStatement
middleware/auth.js:5:44
 const JWT_SECRET = process.env.JWT_SECRET;
 
 // Authentication middleware for protected routes
-module.exports = function (req, res, next) {
-  const token = req.header('x-auth-token');
-  if (!token) {
-    return res.status(401).json({ msg: 'No token, authorization denied' });
-  }
-
-  try {
-    const decoded = jwt.verify(token, JWT_SECRET);
-    req.user = decoded.user;
-    next();
-  } catch (err) {
-    res.status(401).json({ msg: 'Token is not valid' });
-  }
-};
+module.exports = function (req, res, next) {};
 

[Killed] ConditionalExpression
middleware/auth.js:7:7
 // Authentication middleware for protected routes
 module.exports = function (req, res, next) {
   const token = req.header('x-auth-token');
-  if (!token) {
+  if (false) {
     return res.status(401).json({ msg: 'No token, authorization denied' });
   }
killedBy: Products API POST /api/products 401 → rejects create without token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "msg": "No token, authorization denied",
+   "msg": "Token is not valid",

[Killed] BlockStatement
middleware/auth.js:7:15
 // Authentication middleware for protected routes
 module.exports = function (req, res, next) {
   const token = req.header('x-auth-token');
-  if (!token) {
-    return res.status(401).json({ msg: 'No token, authorization denied' });
-  }
+  if (!token) {}
 
   try {
killedBy: Products API POST /api/products 401 → rejects create without token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "msg": "No token, authorization denied",
+   "msg": "Token is not valid",

[Killed] ObjectLiteral
middleware/auth.js:8:33
 module.exports = function (req, res, next) {
   const token = req.header('x-auth-token');
   if (!token) {
-    return res.status(401).json({ msg: 'No token, authorization denied' });
+    return res.status(401).json({});
   }
 
killedBy: Products API POST /api/products 401 → rejects create without token
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "msg": "No token, authorization denied",
- }

[Timeout] BlockStatement
middleware/auth.js:11:7
     return res.status(401).json({ msg: 'No token, authorization denied' });
   }
 
-  try {
-    const decoded = jwt.verify(token, JWT_SECRET);
-    req.user = decoded.user;
-    next();
-  } catch (err) {
+  try {} catch (err) {
     res.status(401).json({ msg: 'Token is not valid' });
   }

[Timeout] BlockStatement
middleware/auth.js:15:17
     const decoded = jwt.verify(token, JWT_SECRET);
     req.user = decoded.user;
     next();
-  } catch (err) {
-    res.status(401).json({ msg: 'Token is not valid' });
-  }
+  } catch (err) {}
 };
 

[Killed] StringLiteral
middleware/auth.js:16:33
     req.user = decoded.user;
     next();
   } catch (err) {
-    res.status(401).json({ msg: 'Token is not valid' });
+    res.status(401).json({ msg: "" });
   }
 };
killedBy: Products API POST /api/products 401 → rejects expired token on protected mutation
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "msg": "Token is not valid",
+   "msg": "",
