[Survived] StringLiteral
routes/checkout.js:241:35
     });
   } catch (error) {
     console.error('Error creating order:', error);
-    res.status(500).json({ error: 'Failed to create order' });
+    res.status(500).json({ error: "" });
   }
 });
