[Killed] Regex
routes/orders.js:6:20
 
 const router = express.Router();
 
-const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const emailRegex = /^[^\s@]+@[^\S@]+\.[^\s@]+$/;
 
 /**
killedBy: Orders API — POST /api/orders/track 404 → order not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Killed] Regex
routes/orders.js:6:20
 
 const router = express.Router();
 
-const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+const emailRegex = /^[\s@]+@[^\s@]+\.[^\s@]+$/;
 
 /**
killedBy: Orders API — POST /api/orders/track 404 → order not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 400

[Killed] StringLiteral
routes/orders.js:67:13
  *         description: Validation error
  */
 
-router.post('/track', async (req, res) => {
+router.post("", async (req, res) => {
   try {
     const { orderNumber, email } = req.body || {};
killedBy: Orders API — POST /api/orders/track 400 → missing orderNumber and email
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] LogicalOperator
routes/orders.js:69:36
 
 router.post('/track', async (req, res) => {
   try {
-    const { orderNumber, email } = req.body || {};
+    const { orderNumber, email } = req.body && {};
 
     if (!orderNumber || !email) {
killedBy: Orders API — POST /api/orders/track 400 → invalid order number format (no FE- prefix)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid order number format.",
+   "error": "Order number and email are required.",

[Killed] ConditionalExpression
routes/orders.js:69:36
 
 router.post('/track', async (req, res) => {
   try {
-    const { orderNumber, email } = req.body || {};
+    const { orderNumber, email } = true;
 
     if (!orderNumber || !email) {
killedBy: Orders API — POST /api/orders/track 400 → invalid order number format (no FE- prefix)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid order number format.",
+   "error": "Order number and email are required.",

[Killed] ConditionalExpression
routes/orders.js:71:9
   try {
     const { orderNumber, email } = req.body || {};
 
-    if (!orderNumber || !email) {
+    if (false) {
       return res.status(400).json({ error: 'Order number and email are required.' });
     }
killedBy: Orders API — POST /api/orders/track 400 → missing orderNumber and email
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Order number and email are required.",
+   "error": "Invalid order number format.",

[Killed] BlockStatement
routes/orders.js:71:33
   try {
     const { orderNumber, email } = req.body || {};
 
-    if (!orderNumber || !email) {
-      return res.status(400).json({ error: 'Order number and email are required.' });
-    }
+    if (!orderNumber || !email) {}
 
     const normalizedOrderNumber = String(orderNumber).trim().toUpperCase();
killedBy: Orders API — POST /api/orders/track 400 → missing orderNumber and email
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Order number and email are required.",
+   "error": "Invalid order number format.",

[Killed] MethodExpression
routes/orders.js:75:35
       return res.status(400).json({ error: 'Order number and email are required.' });
     }
 
-    const normalizedOrderNumber = String(orderNumber).trim().toUpperCase();
+    const normalizedOrderNumber = String(orderNumber).trim().toLowerCase();
     const normalizedEmail = String(email).trim().toLowerCase();
 
killedBy: Orders API — POST /api/orders/track 400 → invalid email format
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid email format.",
+   "error": "Invalid order number format.",

[Survived] MethodExpression
routes/orders.js:75:35
       return res.status(400).json({ error: 'Order number and email are required.' });
     }
 
-    const normalizedOrderNumber = String(orderNumber).trim().toUpperCase();
+    const normalizedOrderNumber = String(orderNumber).toUpperCase();
     const normalizedEmail = String(email).trim().toLowerCase();
 

[Killed] MethodExpression
routes/orders.js:76:29
     }
 
     const normalizedOrderNumber = String(orderNumber).trim().toUpperCase();
-    const normalizedEmail = String(email).trim().toLowerCase();
+    const normalizedEmail = String(email).trim().toUpperCase();
 
     if (!normalizedOrderNumber.startsWith('FE-')) {
killedBy: Orders API — POST /api/orders/track 200 → normalizes order number to uppercase
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "email": "user@test.com",
+   "email": "USER@TEST.COM",

[Survived] MethodExpression
routes/orders.js:76:29
     }
 
     const normalizedOrderNumber = String(orderNumber).trim().toUpperCase();
-    const normalizedEmail = String(email).trim().toLowerCase();
+    const normalizedEmail = String(email).toLowerCase();
 
     if (!normalizedOrderNumber.startsWith('FE-')) {

[Killed] BlockStatement
routes/orders.js:78:51
     const normalizedOrderNumber = String(orderNumber).trim().toUpperCase();
     const normalizedEmail = String(email).trim().toLowerCase();
 
-    if (!normalizedOrderNumber.startsWith('FE-')) {
-      return res.status(400).json({ error: 'Invalid order number format.' });
-    }
+    if (!normalizedOrderNumber.startsWith('FE-')) {}
 
     if (!emailRegex.test(normalizedEmail)) {
killedBy: Orders API — POST /api/orders/track 400 → invalid order number format (no FE- prefix)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] ConditionalExpression
routes/orders.js:78:9
     const normalizedOrderNumber = String(orderNumber).trim().toUpperCase();
     const normalizedEmail = String(email).trim().toLowerCase();
 
-    if (!normalizedOrderNumber.startsWith('FE-')) {
+    if (true) {
       return res.status(400).json({ error: 'Invalid order number format.' });
     }
killedBy: Orders API — POST /api/orders/track 400 → invalid email format
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Invalid email format.",
+   "error": "Invalid order number format.",

[Killed] ObjectLiteral
routes/orders.js:79:35
     const normalizedEmail = String(email).trim().toLowerCase();
 
     if (!normalizedOrderNumber.startsWith('FE-')) {
-      return res.status(400).json({ error: 'Invalid order number format.' });
+      return res.status(400).json({});
     }
 
killedBy: Orders API — POST /api/orders/track 400 → invalid order number format (no FE- prefix)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "Invalid order number format.",
- }

[Killed] BlockStatement
routes/orders.js:82:44
       return res.status(400).json({ error: 'Invalid order number format.' });
     }
 
-    if (!emailRegex.test(normalizedEmail)) {
-      return res.status(400).json({ error: 'Invalid email format.' });
-    }
+    if (!emailRegex.test(normalizedEmail)) {}
 
     const order = await Order.findOne({ orderNumber: normalizedOrderNumber, email: normalizedEmail });
killedBy: Orders API — POST /api/orders/track 400 → invalid email format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] ConditionalExpression
routes/orders.js:82:9
       return res.status(400).json({ error: 'Invalid order number format.' });
     }
 
-    if (!emailRegex.test(normalizedEmail)) {
+    if (false) {
       return res.status(400).json({ error: 'Invalid email format.' });
     }
killedBy: Orders API — POST /api/orders/track 400 → invalid email format
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 404

[Killed] BooleanLiteral
routes/orders.js:88:9
 
     const order = await Order.findOne({ orderNumber: normalizedOrderNumber, email: normalizedEmail });
 
-    if (!order) {
+    if (order) {
       return res.status(404).json({ error: 'Order not found. Double-check your email and order number.' });
     }
killedBy: Orders API — POST /api/orders/track 404 → order not found
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 404
Received: 500

[Killed] ConditionalExpression
routes/orders.js:88:9
 
     const order = await Order.findOne({ orderNumber: normalizedOrderNumber, email: normalizedEmail });
 
-    if (!order) {
+    if (true) {
       return res.status(404).json({ error: 'Order not found. Double-check your email and order number.' });
     }
killedBy: Orders API — POST /api/orders/track 200 → returns order status when found (no advance)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 200
Received: 404

[Killed] StringLiteral
routes/orders.js:89:44
     const order = await Order.findOne({ orderNumber: normalizedOrderNumber, email: normalizedEmail });
 
     if (!order) {
-      return res.status(404).json({ error: 'Order not found. Double-check your email and order number.' });
+      return res.status(404).json({ error: "" });
     }
 
killedBy: Orders API — POST /api/orders/track 404 → order not found
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "Order not found. Double-check your email and order number.",
+   "error": "",

[Survived] BooleanLiteral
routes/orders.js:94:20
 
     order.ensureInitialStatus();
 
-    let advanced = false;
+    let advanced = true;
     if (order.statusIndex < Order.STATUS_FLOW.length - 1) {
       const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : Math.random() < 0.35;

[Survived] ArithmeticOperator
routes/orders.js:95:29
     order.ensureInitialStatus();
 
     let advanced = false;
-    if (order.statusIndex < Order.STATUS_FLOW.length - 1) {
+    if (order.statusIndex < Order.STATUS_FLOW.length + 1) {
       const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : Math.random() < 0.35;
       if (shouldAdvance) {

[Survived] BlockStatement
routes/orders.js:95:59
     order.ensureInitialStatus();
 
     let advanced = false;
-    if (order.statusIndex < Order.STATUS_FLOW.length - 1) {
-      const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : Math.random() < 0.35;
-      if (shouldAdvance) {
-        advanced = order.advanceStatus();
-      }
-    }
+    if (order.statusIndex < Order.STATUS_FLOW.length - 1) {}
 
     if (advanced) {

[Survived] EqualityOperator
routes/orders.js:96:85
 
     let advanced = false;
     if (order.statusIndex < Order.STATUS_FLOW.length - 1) {
-      const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : Math.random() < 0.35;
+      const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : Math.random() >= 0.35;
       if (shouldAdvance) {
         advanced = order.advanceStatus();

[Survived] ConditionalExpression
routes/orders.js:96:85
 
     let advanced = false;
     if (order.statusIndex < Order.STATUS_FLOW.length - 1) {
-      const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : Math.random() < 0.35;
+      const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : true;
       if (shouldAdvance) {
         advanced = order.advanceStatus();

[Survived] ConditionalExpression
routes/orders.js:97:11
     let advanced = false;
     if (order.statusIndex < Order.STATUS_FLOW.length - 1) {
       const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : Math.random() < 0.35;
-      if (shouldAdvance) {
+      if (true) {
         advanced = order.advanceStatus();
       }

[Survived] ConditionalExpression
routes/orders.js:97:11
     let advanced = false;
     if (order.statusIndex < Order.STATUS_FLOW.length - 1) {
       const shouldAdvance = order.statusHistory.length > 1 ? Math.random() < 0.75 : Math.random() < 0.35;
-      if (shouldAdvance) {
+      if (false) {
         advanced = order.advanceStatus();
       }

[Survived] ConditionalExpression
routes/orders.js:102:9
       }
     }
 
-    if (advanced) {
+    if (false) {
       order.markModified('statusHistory');
     }

[Survived] BlockStatement
routes/orders.js:102:19
       }
     }
 
-    if (advanced) {
-      order.markModified('statusHistory');
-    }
+    if (advanced) {}
 
     await order.save();

[Survived] ArithmeticOperator
routes/orders.js:111:42
     const responsePayload = {
       orderNumber: order.orderNumber,
       email: order.email,
-      currentStatus: order.statusHistory[order.statusHistory.length - 1],
+      currentStatus: order.statusHistory[order.statusHistory.length + 1],
       statusHistory: order.statusHistory,
       statusFlow: Order.STATUS_FLOW,

[Killed] BlockStatement
routes/orders.js:122:19
     };
 
     res.json(responsePayload);
-  } catch (error) {
-    console.error('Error tracking order:', error);
-    res.status(500).json({ error: 'Unable to fetch order status right now.' });
-  }
+  } catch (error) {}
 });
 
killedBy: Orders API — POST /api/orders/track 500 → internal server error
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
routes/orders.js:123:19
 
     res.json(responsePayload);
   } catch (error) {
-    console.error('Error tracking order:', error);
+    console.error("", error);
     res.status(500).json({ error: 'Unable to fetch order status right now.' });
   }
